GET_ROLE = "Напишите роль в которой должен общаться ChatGPT"
ROLE_SAVED = "Роль сохранена"
ROLE_SAVED_ERROR = (
    "Не удалось сохранить роль. У вас уже есть контекст диалога. "
    "Чтобы сохранить роль, сначала очистите контекст диалога"
)
CONTEXT_CLEAR = "Контекст очищен"
IMAGE_PROMPT = "Введите запрос для генерации изображения"
IMAGE_ERROR = "Не удалось сгенерировать изображение"
STATUS_MESSAGE = "⠀\n✅ Запрос отправлен\n⠀"
MODEL_NOT_SELECTED = (
    "Модель не выбрана. Для выбора модели перейдите в настройки /settings"
)
